In [1]:
# https://youtu.be/8gGNXQgCmIE?si=NETH_JUZNOdWdOf3
# https://youtu.be/FXKMmilL70w?si=ZppZlY8w9rQBOELW

# Indexing & Filtering

In [2]:
import numpy as np
import pandas as pd

## Series and DataFrames

In [3]:
# https://youtu.be/QjYFQUC7AQ4?si=1Jz6H-YbExWQJdkh

In [4]:
t = [1, 2, 3, 4, 5]
ts = pd.Series(t)
ts

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
days = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri']
ts = pd.Series(t, index=days)
ts

Mon    1
Tue    2
Wed    3
Thu    4
Fri    5
dtype: int64

In [6]:
fruits = {'apple': 10, 'banana': 15, 'cherry': 20}
fs = pd.Series(fruits)
fs

apple     10
banana    15
cherry    20
dtype: int64

In [7]:
data = {
    'Name': ['John', 'Mary', 'Lily'],
    'Age': [24, 30, 29]
}
df1 = pd.DataFrame(data)
df1

   Name  Age
0  John   24
1  Mary   30
2  Lily   29

In [8]:
data2 = [
    {'Name': 'John', 'Age': 24},
    {'Name': 'John1', 'Age': 28},
    {'Name': 'John2', 'Age': 27}
]
df2 = pd.DataFrame(data2)
df2

    Name  Age
0   John   24
1  John1   28
2  John2   27

In [9]:
age = df2['Age']
age

0    24
1    28
2    27
Name: Age, dtype: int64

In [10]:
df2['Age'] = [1, 2, 3]
df2

    Name  Age
0   John    1
1  John1    2
2  John2    3

In [104]:
df2.loc[0]

Employee             Mary
Salary               2000
Department             IT
Bonus               200.0
Adjusted Salary    2100.0
Name: 0, dtype: object

In [12]:
df2 = df2.drop('Age', axis=1)
df2

    Name
0   John
1  John1
2  John2

## Indexing and Filtering

In [13]:
student_data = {
    'Name': ['John', 'Mary', 'Lily', 'Sue'],
    'Math': [85, 92, 78, 88],
    'Science': [91, 89, 84, 85],
    'English': [79, 85, 87, 90]
}

df = pd.DataFrame(student_data, index=['a', 'b', 'c', 'd'])
df

   Name  Math  Science  English
a  John    85       91       79
b  Mary    92       89       85
c  Lily    78       84       87
d   Sue    88       85       90

### Selecting Columns

In [14]:
df['Math']

a    85
b    92
c    78
d    88
Name: Math, dtype: int64

In [15]:
df[['Math', 'English']]

   Math  English
a    85       79
b    92       85
c    78       87
d    88       90

### Selecting Rows

In [16]:
df[0:2]

   Name  Math  Science  English
a  John    85       91       79
b  Mary    92       89       85

In [17]:
df.loc['a']

Name       John
Math         85
Science      91
English      79
Name: a, dtype: object

In [18]:
df.loc[['a', 'c']]

   Name  Math  Science  English
a  John    85       91       79
c  Lily    78       84       87

In [19]:
df.loc['a': 'c']

   Name  Math  Science  English
a  John    85       91       79
b  Mary    92       89       85
c  Lily    78       84       87

In [20]:
df.iloc[1:3]

   Name  Math  Science  English
b  Mary    92       89       85
c  Lily    78       84       87

### Selecting Rows and Columns

In [21]:
df.loc['a':'c', ['Math', 'English']]

   Math  English
a    85       79
b    92       85
c    78       87

In [22]:
df.iloc[2:3, [3]]

   English
c       87

### Filtering

In [23]:
df['Math'] > 80

a     True
b     True
c    False
d     True
Name: Math, dtype: bool

In [24]:
df[df['Math'] > 80]

   Name  Math  Science  English
a  John    85       91       79
b  Mary    92       89       85
d   Sue    88       85       90

In [25]:
df[(df['Math'] > 80) & (df['English'] > 90) | (df['Science']) < 100]

   Name  Math  Science  English
a  John    85       91       79
b  Mary    92       89       85
c  Lily    78       84       87
d   Sue    88       85       90

In [26]:
df[df['Name'].isin(['Sue'])]

  Name  Math  Science  English
d  Sue    88       85       90

In [27]:
df.where(df['Math'] < 90, 42)

   Name  Math  Science  English
a  John    85       91       79
b    42    42       42       42
c  Lily    78       84       87
d   Sue    88       85       90

# Data Analysis Functions

In [28]:
# https://youtu.be/pnuZ_xDllZU?si=VUKdqoJ7uau2DENm

In [29]:
data = {
    'Employee': ['John', 'Mary', 'Lily', 'Sue', 'Bob'],
    'Salary': [1000, 2000, 3000, 4000, 5000],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR']
}

In [30]:
df = pd.DataFrame(data)
df

  Employee  Salary Department
0     John    1000         HR
1     Mary    2000         IT
2     Lily    3000    Finance
3      Sue    4000         IT
4      Bob    5000         HR

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Employee    5 non-null      object
 1   Salary      5 non-null      int64
 2   Department  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [32]:
df.columns

Index(['Employee', 'Salary', 'Department'], dtype='object')

In [33]:
df.keys()

Index(['Employee', 'Salary', 'Department'], dtype='object')

In [34]:
df.head(3)

  Employee  Salary Department
0     John    1000         HR
1     Mary    2000         IT
2     Lily    3000    Finance

In [35]:
df.tail(3)

  Employee  Salary Department
2     Lily    3000    Finance
3      Sue    4000         IT
4      Bob    5000         HR

In [36]:
# numpy array
df.values

array([['John', 1000, 'HR'],
       ['Mary', 2000, 'IT'],
       ['Lily', 3000, 'Finance'],
       ['Sue', 4000, 'IT'],
       ['Bob', 5000, 'HR']], dtype=object)

In [37]:
df.size

15

In [38]:
df.shape

(5, 3)

In [39]:
df.shape[0]

5

In [40]:
df['Department'].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [41]:
df['Department'].nunique()

3

In [42]:
df['Department'].value_counts()

Department
HR         2
IT         2
Finance    1
Name: count, dtype: int64

In [43]:
def calc_bonus(salary):
    return salary * 0.1

In [44]:
df['Bonus'] = df['Salary'].apply(calc_bonus)
df

  Employee  Salary Department  Bonus
0     John    1000         HR  100.0
1     Mary    2000         IT  200.0
2     Lily    3000    Finance  300.0
3      Sue    4000         IT  400.0
4      Bob    5000         HR  500.0

In [45]:
df['Adjusted Salary'] = df['Salary'].apply(lambda x: x * 1.05)
df

  Employee  Salary Department  Bonus  Adjusted Salary
0     John    1000         HR  100.0           1050.0
1     Mary    2000         IT  200.0           2100.0
2     Lily    3000    Finance  300.0           3150.0
3      Sue    4000         IT  400.0           4200.0
4      Bob    5000         HR  500.0           5250.0

In [46]:
df_upper = df.applymap(lambda x: x.upper() if type(x) == str else x)
df_upper

/var/folders/6l/0v0lczzd3zg_6n8l7ysp7gyc0000gn/T/ipykernel_70168/1173992352.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_upper = df.applymap(lambda x: x.upper() if type(x) == str else x)

  Employee  Salary Department  Bonus  Adjusted Salary
0     JOHN    1000         HR  100.0           1050.0
1     MARY    2000         IT  200.0           2100.0
2     LILY    3000    FINANCE  300.0           3150.0
3      SUE    4000         IT  400.0           4200.0
4      BOB    5000         HR  500.0           5250.0

In [47]:
df.sort_values(by='Salary', ascending=False)

  Employee  Salary Department  Bonus  Adjusted Salary
4      Bob    5000         HR  500.0           5250.0
3      Sue    4000         IT  400.0           4200.0
2     Lily    3000    Finance  300.0           3150.0
1     Mary    2000         IT  200.0           2100.0
0     John    1000         HR  100.0           1050.0

In [48]:
df2 = df.sort_values(by=['Department', 'Bonus'], ascending=[False, True])

In [49]:
df2.reset_index(drop=True, inplace=True)
df2

  Employee  Salary Department  Bonus  Adjusted Salary
0     Mary    2000         IT  200.0           2100.0
1      Sue    4000         IT  400.0           4200.0
2     John    1000         HR  100.0           1050.0
3      Bob    5000         HR  500.0           5250.0
4     Lily    3000    Finance  300.0           3150.0

# Grouping and Aggregation

In [50]:
# https://youtu.be/7uIqaMevDvQ?si=00zawEIEmlDkoHZA

In [51]:
data = {
    'Product ID': [1, 2, 3, 4, 5],
    'Product Name': ['Apple', 'Banana', 'Apple', 'Mango', 'Banana'],
    'Price': [10, 20, 30, 40, 50],
    'Quantity': [100, 200, 300, 400, 500]
}

In [52]:
df = pd.DataFrame(data)
df

   Product ID Product Name  Price  Quantity
0           1        Apple     10       100
1           2       Banana     20       200
2           3        Apple     30       300
3           4        Mango     40       400
4           5       Banana     50       500

In [53]:
df.describe().transpose()

            count   mean         std    min    25%    50%    75%    max
Product ID    5.0    3.0    1.581139    1.0    2.0    3.0    4.0    5.0
Price         5.0   30.0   15.811388   10.0   20.0   30.0   40.0   50.0
Quantity      5.0  300.0  158.113883  100.0  200.0  300.0  400.0  500.0

In [54]:
df['Price'].mean() # AVG

30.0

In [55]:
df['Price'].median() # middle value in sorted array

30.0

In [56]:
df['Price'].mode() # most frequent value

0    10
1    20
2    30
3    40
4    50
Name: Price, dtype: int64

In [57]:
df['Price'].std() # standard deviation

15.811388300841896

In [58]:
df['Price'].var() # how far numbers spread from mean

250.0

In [59]:
df['Price'].sum()

150

In [60]:
df['Price'].prod() # product

12000000

In [61]:
df

   Product ID Product Name  Price  Quantity
0           1        Apple     10       100
1           2       Banana     20       200
2           3        Apple     30       300
3           4        Mango     40       400
4           5       Banana     50       500

In [62]:
gr = df.groupby('Product Name')
gr

In [63]:
gr['Quantity'].mean()

Product Name
Apple     200.0
Banana    350.0
Mango     400.0
Name: Quantity, dtype: float64

In [64]:
gr['Price'].sum()

Product Name
Apple     40
Banana    70
Mango     40
Name: Price, dtype: int64

In [65]:
gr['Price'].agg(['mean', 'median', 'sum'])

              mean  median  sum
Product Name
Apple         20.0    20.0   40
Banana        35.0    35.0   70
Mango         40.0    40.0   40

In [66]:
gr_multi = df.groupby(['Product Name', 'Price'])

In [67]:
gr_multi['Quantity'].sum()

Product Name  Price
Apple         10       100
              30       300
Banana        20       200
              50       500
Mango         40       400
Name: Quantity, dtype: int64

In [68]:
gr.agg({'Quantity': ['sum', 'mean', 'max'], 'Price': 'sum'})

             Quantity             Price
                  sum   mean  max   sum
Product Name
Apple             400  200.0  300    40
Banana            700  350.0  500    70
Mango             400  400.0  400    40

In [69]:
def data_range(x):
    return x.max() - x.min()

In [70]:
gr['Quantity'].apply(data_range)

Product Name
Apple     200
Banana    300
Mango       0
Name: Quantity, dtype: int64

# Join, Merge & Concatenate

In [71]:
# https://youtu.be/0XYIWsNPXNc?si=xAhWYTaspiL0f26a

In [72]:
sales_jan = pd.DataFrame({
    'Product': ['Apple', 'Banana', 'Apple', 'Mango', 'Banana'],
    'Sales': [100, 70, 60, 80, 100]
}, index=['a', 'b', 'c', 'd', 'e'])

sales_feb = pd.DataFrame({
    'Product': ['Apple', 'Banana', 'Apple', 'Mango', 'Banana'],
    'Sales': [300, 50, 80, 30, 60]
}, index=['f', 'g', 'h', 'i', 'j'])

sales_mar = pd.DataFrame({
    'Product': ['Apple', 'Banana', 'Apple', 'Mango', 'Banana'],
    'Sales': [70, 60, 30, 80, 50]
}, index=['k', 'l', 'm', 'n', 'o'])

In [73]:
sales_jan

  Product  Sales
a   Apple    100
b  Banana     70
c   Apple     60
d   Mango     80
e  Banana    100

In [74]:
sales_feb

  Product  Sales
f   Apple    300
g  Banana     50
h   Apple     80
i   Mango     30
j  Banana     60

In [75]:
pd.concat([sales_jan, sales_feb, sales_mar])

  Product  Sales
a   Apple    100
b  Banana     70
c   Apple     60
d   Mango     80
e  Banana    100
f   Apple    300
g  Banana     50
h   Apple     80
i   Mango     30
j  Banana     60
k   Apple     70
l  Banana     60
m   Apple     30
n   Mango     80
o  Banana     50

In [76]:
pd.concat([sales_jan, sales_feb, sales_mar], axis=1)

  Product  Sales Product  Sales Product  Sales
a   Apple  100.0     NaN    NaN     NaN    NaN
b  Banana   70.0     NaN    NaN     NaN    NaN
c   Apple   60.0     NaN    NaN     NaN    NaN
d   Mango   80.0     NaN    NaN     NaN    NaN
e  Banana  100.0     NaN    NaN     NaN    NaN
f     NaN    NaN   Apple  300.0     NaN    NaN
g     NaN    NaN  Banana   50.0     NaN    NaN
h     NaN    NaN   Apple   80.0     NaN    NaN
i     NaN    NaN   Mango   30.0     NaN    NaN
j     NaN    NaN  Banana   60.0     NaN    NaN
k     NaN    NaN     NaN    NaN   Apple   70.0
l     NaN    NaN     NaN    NaN  Banana   60.0
m     NaN    NaN     NaN    NaN   Apple   30.0
n     NaN    NaN     NaN    NaN   Mango   80.0
o     NaN    NaN     NaN    NaN  Banana   50.0

In [77]:
customers = pd.DataFrame({
    'Customer ID': ['A', 'B', 'C', 'D', 'E'],
    'Customer Name': ['John', 'Mary', 'Lily', 'Sue', 'Bob'],
    'City': ['New York', 'Paris', 'London', 'Tokyo', 'Berlin']
})

In [78]:
purchases = pd.DataFrame({
    'Customer ID': ['A', 'B', 'C'],
    'Product': ['Apple', 'Banana', 'Mango'],
    'Quantity': [10, 20, 30],
    'City': ['New York', 'Paris', 'Tokyo']
})

In [79]:
pd.merge(customers, purchases, on='Customer ID')  # inner join

  Customer ID Customer Name    City_x Product  Quantity    City_y
0           A          John  New York   Apple        10  New York
1           B          Mary     Paris  Banana        20     Paris
2           C          Lily    London   Mango        30     Tokyo

In [80]:
pd.merge(customers, purchases, how='outer', on='Customer ID')

  Customer ID Customer Name    City_x Product  Quantity    City_y
0           A          John  New York   Apple      10.0  New York
1           B          Mary     Paris  Banana      20.0     Paris
2           C          Lily    London   Mango      30.0     Tokyo
3           D           Sue     Tokyo     NaN       NaN       NaN
4           E           Bob    Berlin     NaN       NaN       NaN

In [81]:
pd.merge(customers, purchases, how='left', on=['Customer ID', 'City'])

  Customer ID Customer Name      City Product  Quantity
0           A          John  New York   Apple      10.0
1           B          Mary     Paris  Banana      20.0
2           C          Lily    London     NaN       NaN
3           D           Sue     Tokyo     NaN       NaN
4           E           Bob    Berlin     NaN       NaN

In [82]:
customers2 = pd.DataFrame({
    'Customer ID': ['A', 'B', 'C', 'D', 'E'],
    'Customer Name': ['John', 'Mary', 'Lily', 'Sue', 'Bob'],
}, index=['New York', 'Paris', 'London', 'Tokyo', 'Berlin'])

In [83]:
purchases2 = pd.DataFrame({
    'Customer ID': ['A', 'B', 'C'],
    'Product': ['Apple', 'Banana', 'Mango'],
    'Quantity': [10, 20, 30]
}, index=['New York', 'Paris', 'Tokyo'])

In [84]:
customers2

         Customer ID Customer Name
New York           A          John
Paris              B          Mary
London             C          Lily
Tokyo              D           Sue
Berlin             E           Bob

In [85]:
purchases2.join(customers2, lsuffix='_left', rsuffix='_right')

         Customer ID_left Product  Quantity Customer ID_right Customer Name
New York                A   Apple        10                 A          John
Paris                   B  Banana        20                 B          Mary
Tokyo                   C   Mango        30                 D           Sue

# Handling Missing Data

In [86]:
# https://youtu.be/zb4xMLcpBVs?si=69Aui-k9ap10bJvv

In [87]:
import numpy as np

In [88]:
data = {
    'Name': ['John', 'Mary', 'Lily', np.nan, 'Sue'],
    'Age': [24, np.nan, 29, 31, np.nan],
    'Score': [85, 90, np.nan, 88, 96]
}

In [89]:
df = pd.DataFrame(data)
df

   Name   Age  Score
0  John  24.0   85.0
1  Mary   NaN   90.0
2  Lily  29.0    NaN
3   NaN  31.0   88.0
4   Sue   NaN   96.0

In [90]:
df.isnull()

    Name    Age  Score
0  False  False  False
1  False   True  False
2  False  False   True
3   True  False  False
4  False   True  False

In [91]:
df.notnull()

    Name    Age  Score
0   True   True   True
1   True  False   True
2   True   True  False
3  False   True   True
4   True  False   True

In [92]:
df.isnull().sum()

Name     1
Age      2
Score    1
dtype: int64

In [93]:
df.dropna()

   Name   Age  Score
0  John  24.0   85.0

In [94]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [95]:
df.fillna('Unknown')

      Name      Age    Score
0     John     24.0     85.0
1     Mary  Unknown     90.0
2     Lily     29.0  Unknown
3  Unknown     31.0     88.0
4      Sue  Unknown     96.0

In [96]:
df.ffill()

   Name   Age  Score
0  John  24.0   85.0
1  Mary  24.0   90.0
2  Lily  29.0   90.0
3  Lily  31.0   88.0
4   Sue  31.0   96.0

In [97]:
df.bfill()

   Name   Age  Score
0  John  24.0   85.0
1  Mary  29.0   90.0
2  Lily  29.0   88.0
3   Sue  31.0   88.0
4   Sue   NaN   96.0

In [98]:
mean_age = df['Age'].mean()
mean_age

28.0

In [99]:
df['Age'].fillna(mean_age)

0    24.0
1    28.0
2    29.0
3    31.0
4    28.0
Name: Age, dtype: float64

In [100]:
fill_values = {'Name': 'Sue', 'Age': 25, 'Score': 95}

In [101]:
filled = df.fillna(fill_values)
filled

   Name   Age  Score
0  John  24.0   85.0
1  Mary  25.0   90.0
2  Lily  29.0   95.0
3   Sue  31.0   88.0
4   Sue  25.0   96.0